test/load/#07_04-04-2024.txt
$ npm run test:stress

> car-rent-nest@0.0.1 test:stress
> npx autocannon -c 500 -d 20 -w 10 -W [ -c 1 -d 3 ] --renderStatusCodes --latency http://localhost:3000/cars

Running 3s warmup @ http://localhost:3000/cars
1 connections
10 workers

Running 20s test @ http://localhost:3000/cars
500 connections
10 workers

\
┌─────────┬────────┬────────┬─────────┬─────────┬────────────┬────────────┬──────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%   │ 99%     │ Avg        │ Stdev      │ Max      │
├─────────┼────────┼────────┼─────────┼─────────┼────────────┼────────────┼──────────┤
│ Latency │ 207 ms │ 228 ms │ 5049 ms │ 9077 ms │ 1119.21 ms │ 1867.49 ms │ 19886 ms │
└─────────┴────────┴────────┴─────────┴─────────┴────────────┴────────────┴──────────┘
┌───────────┬────────┬────────┬─────────┬─────────┬──────────┬─────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%     │ 97.5%   │ Avg      │ Stdev   │ Min    │
├───────────┼────────┼────────┼─────────┼─────────┼──────────┼─────────┼────────┤
│ Req/Sec   │ 1.566  │ 1.566  │ 2.261   │ 2.417   │ 2.232,15 │ 167,59  │ 1.566  │
├───────────┼────────┼────────┼─────────┼─────────┼──────────┼─────────┼────────┤
│ Bytes/Sec │ 708 kB │ 708 kB │ 1.02 MB │ 1.09 MB │ 1.01 MB  │ 75.8 kB │ 708 kB │
└───────────┴────────┴────────┴─────────┴─────────┴──────────┴─────────┴────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 44633 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 60           │
├────────────┼──────────────┤
│ 0.01       │ 62           │
├────────────┼──────────────┤
│ 0.1        │ 121          │
├────────────┼──────────────┤
│ 1          │ 168          │
├────────────┼──────────────┤
│ 2.5        │ 207          │
├────────────┼──────────────┤
│ 10         │ 211          │
├────────────┼──────────────┤
│ 25         │ 215          │
├────────────┼──────────────┤
│ 50         │ 228          │
├────────────┼──────────────┤
│ 75         │ 696          │
├────────────┼──────────────┤
│ 90         │ 4268         │
├────────────┼──────────────┤
│ 97.5       │ 5049         │
├────────────┼──────────────┤
│ 99         │ 9077         │
├────────────┼──────────────┤
│ 99.9       │ 15205        │
├────────────┼──────────────┤
│ 99.99      │ 19464        │
├────────────┼──────────────┤
│ 99.999     │ 19886        │
└────────────┴──────────────┘

48k requests in 20.16s, 20.2 MB read
2k errors (0 timeouts)