test/load/#08_04-04-2024.txt
$ npm run test:stress

> car-rent-nest@0.0.1 test:stress
> npx autocannon -c 500 -d 20 -w 10 -W [ -c 1 -d 3 ] --renderStatusCodes --latency http://localhost:3000/cars

Running 3s warmup @ http://localhost:3000/cars
1 connections
10 workers

Running 20s test @ http://localhost:3000/cars
500 connections
10 workers

|
┌─────────┬───────┬───────┬────────┬────────┬─────────┬──────────┬────────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5%  │ 99%    │ Avg     │ Stdev    │ Max    │
├─────────┼───────┼───────┼────────┼────────┼─────────┼──────────┼────────┤
│ Latency │ 28 ms │ 47 ms │ 329 ms │ 435 ms │ 70.2 ms │ 72.71 ms │ 694 ms │
└─────────┴───────┴───────┴────────┴────────┴─────────┴──────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬──────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg      │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼──────────┼────────┼─────────┤
│ Req/Sec   │ 1.748   │ 1.748   │ 3.215   │ 3.785   │ 3.167,05 │ 491,29 │ 1.748   │
├───────────┼─────────┼─────────┼─────────┼─────────┼──────────┼────────┼─────────┤
│ Bytes/Sec │ 1.18 MB │ 1.18 MB │ 2.16 MB │ 2.54 MB │ 2.13 MB  │ 330 kB │ 1.17 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴──────────┴────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 63330 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 20           │
├────────────┼──────────────┤
│ 0.01       │ 21           │
├────────────┼──────────────┤
│ 0.1        │ 23           │
├────────────┼──────────────┤
│ 1          │ 26           │
├────────────┼──────────────┤
│ 2.5        │ 28           │
├────────────┼──────────────┤
│ 10         │ 32           │
├────────────┼──────────────┤
│ 25         │ 40           │
├────────────┼──────────────┤
│ 50         │ 47           │
├────────────┼──────────────┤
│ 75         │ 62           │
├────────────┼──────────────┤
│ 90         │ 122          │
├────────────┼──────────────┤
│ 97.5       │ 329          │
├────────────┼──────────────┤
│ 99         │ 435          │
├────────────┼──────────────┤
│ 99.9       │ 543          │
├────────────┼──────────────┤
│ 99.99      │ 604          │
├────────────┼──────────────┤
│ 99.999     │ 694          │
└────────────┴──────────────┘

65k requests in 20.07s, 42.6 MB read
1k errors (557 timeouts)