test/load/#09_04-04-2024.txt
$ npm run test:stress

> car-rent-nest@0.0.1 test:stress
> npx autocannon -c 500 -d 20 -w 10 -W [ -c 1 -d 3 ] --renderStatusCodes --latency http://localhost:3000/cars

Running 3s warmup @ http://localhost:3000/cars
1 connections
10 workers

Running 20s test @ http://localhost:3000/cars
500 connections
10 workers

/
┌─────────┬────────┬────────┬─────────┬──────────┬────────────┬────────────┬──────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%   │ 99%      │ Avg        │ Stdev      │ Max      │
├─────────┼────────┼────────┼─────────┼──────────┼────────────┼────────────┼──────────┤
│ Latency │ 212 ms │ 241 ms │ 7596 ms │ 11946 ms │ 1297.17 ms │ 2293.24 ms │ 15807 ms │
└─────────┴────────┴────────┴─────────┴──────────┴────────────┴────────────┴──────────┘
┌───────────┬────────┬────────┬────────┬─────────┬──────────┬─────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%    │ 97.5%   │ Avg      │ Stdev   │ Min    │
├───────────┼────────┼────────┼────────┼─────────┼──────────┼─────────┼────────┤
│ Req/Sec   │ 1.460  │ 1.460  │ 2.175  │ 2.337   │ 2.123,31 │ 202,26  │ 1.460  │
├───────────┼────────┼────────┼────────┼─────────┼──────────┼─────────┼────────┤
│ Bytes/Sec │ 660 kB │ 660 kB │ 984 kB │ 1.06 MB │ 960 kB   │ 91.4 kB │ 660 kB │
└───────────┴────────┴────────┴────────┴─────────┴──────────┴─────────┴────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 42459 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 78           │
├────────────┼──────────────┤
│ 0.01       │ 82           │
├────────────┼──────────────┤
│ 0.1        │ 111          │
├────────────┼──────────────┤
│ 1          │ 174          │
├────────────┼──────────────┤
│ 2.5        │ 212          │
├────────────┼──────────────┤
│ 10         │ 216          │
├────────────┼──────────────┤
│ 25         │ 221          │
├────────────┼──────────────┤
│ 50         │ 241          │
├────────────┼──────────────┤
│ 75         │ 1153         │
├────────────┼──────────────┤
│ 90         │ 3517         │
├────────────┼──────────────┤
│ 97.5       │ 7596         │
├────────────┼──────────────┤
│ 99         │ 11946        │
├────────────┼──────────────┤
│ 99.9       │ 15309        │
├────────────┼──────────────┤
│ 99.99      │ 15556        │
├────────────┼──────────────┤
│ 99.999     │ 15807        │
└────────────┴──────────────┘

46k requests in 20.12s, 19.2 MB read
3k errors (0 timeouts)