test/load/#09_04-04-2024.txt
$ npm run test:stress

> car-rent-nest@0.0.1 test:stress
> npx autocannon -c 500 -d 20 -w 10 -W [ -c 1 -d 3 ] --renderStatusCodes --latency http://localhost:3000/cars

Running 3s warmup @ http://localhost:3000/cars
1 connections
10 workers

Running 20s test @ http://localhost:3000/cars
500 connections
10 workers

|
┌─────────┬───────┬───────┬────────┬────────┬──────────┬──────────┬────────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5%  │ 99%    │ Avg      │ Stdev    │ Max    │
├─────────┼───────┼───────┼────────┼────────┼──────────┼──────────┼────────┤
│ Latency │ 25 ms │ 43 ms │ 294 ms │ 370 ms │ 67.85 ms │ 68.66 ms │ 521 ms │
└─────────┴───────┴───────┴────────┴────────┴──────────┴──────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬─────────┬──────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%   │ Avg      │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼─────────┼─────────┼──────────┼────────┼─────────┤
│ Req/Sec   │ 2.161   │ 2.161   │ 3.399   │ 4.119   │ 3.383,25 │ 501,43 │ 2.160   │
├───────────┼─────────┼─────────┼─────────┼─────────┼──────────┼────────┼─────────┤
│ Bytes/Sec │ 1.45 MB │ 1.45 MB │ 2.29 MB │ 2.77 MB │ 2.27 MB  │ 337 kB │ 1.45 MB │
└───────────┴─────────┴─────────┴─────────┴─────────┴──────────┴────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 67655 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 16           │
├────────────┼──────────────┤
│ 0.01       │ 18           │
├────────────┼──────────────┤
│ 0.1        │ 21           │
├────────────┼──────────────┤
│ 1          │ 23           │
├────────────┼──────────────┤
│ 2.5        │ 25           │
├────────────┼──────────────┤
│ 10         │ 28           │
├────────────┼──────────────┤
│ 25         │ 35           │
├────────────┼──────────────┤
│ 50         │ 43           │
├────────────┼──────────────┤
│ 75         │ 62           │
├────────────┼──────────────┤
│ 90         │ 146          │
├────────────┼──────────────┤
│ 97.5       │ 294          │
├────────────┼──────────────┤
│ 99         │ 370          │
├────────────┼──────────────┤
│ 99.9       │ 460          │
├────────────┼──────────────┤
│ 99.99      │ 508          │
├────────────┼──────────────┤
│ 99.999     │ 521          │
└────────────┴──────────────┘

69k requests in 20.06s, 45.5 MB read
1k errors (559 timeouts)