test/load/#10_04-04-2024.txt
$ npm run test:stress

> car-rent-nest@0.0.1 test:stress
> npx autocannon -c 500 -d 20 -w 10 -W [ -c 1 -d 3 ] --renderStatusCodes --latency http://localhost:3000/cars

Running 3s warmup @ http://localhost:3000/cars
1 connections
10 workers

Running 20s test @ http://localhost:3000/cars
500 connections
10 workers

|
┌─────────┬───────┬───────┬────────┬────────┬──────────┬──────────┬────────┐
│ Stat    │ 2.5%  │ 50%   │ 97.5%  │ 99%    │ Avg      │ Stdev    │ Max    │
├─────────┼───────┼───────┼────────┼────────┼──────────┼──────────┼────────┤
│ Latency │ 27 ms │ 43 ms │ 350 ms │ 466 ms │ 65.39 ms │ 76.82 ms │ 634 ms │
└─────────┴───────┴───────┴────────┴────────┴──────────┴──────────┴────────┘
┌───────────┬─────────┬─────────┬─────────┬────────┬─────────┬────────┬─────────┐
│ Stat      │ 1%      │ 2.5%    │ 50%     │ 97.5%  │ Avg     │ Stdev  │ Min     │
├───────────┼─────────┼─────────┼─────────┼────────┼─────────┼────────┼─────────┤
│ Req/Sec   │ 2.069   │ 2.069   │ 3.431   │ 4.013  │ 3.333,5 │ 513,46 │ 2.069   │
├───────────┼─────────┼─────────┼─────────┼────────┼─────────┼────────┼─────────┤
│ Bytes/Sec │ 1.39 MB │ 1.39 MB │ 2.31 MB │ 2.7 MB │ 2.24 MB │ 345 kB │ 1.39 MB │
└───────────┴─────────┴─────────┴─────────┴────────┴─────────┴────────┴─────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 66658 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 13           │
├────────────┼──────────────┤
│ 0.01       │ 21           │
├────────────┼──────────────┤
│ 0.1        │ 23           │
├────────────┼──────────────┤
│ 1          │ 25           │
├────────────┼──────────────┤
│ 2.5        │ 27           │
├────────────┼──────────────┤
│ 10         │ 30           │
├────────────┼──────────────┤
│ 25         │ 36           │
├────────────┼──────────────┤
│ 50         │ 43           │
├────────────┼──────────────┤
│ 75         │ 52           │
├────────────┼──────────────┤
│ 90         │ 105          │
├────────────┼──────────────┤
│ 97.5       │ 350          │
├────────────┼──────────────┤
│ 99         │ 466          │
├────────────┼──────────────┤
│ 99.9       │ 555          │
├────────────┼──────────────┤
│ 99.99      │ 620          │
├────────────┼──────────────┤
│ 99.999     │ 634          │
└────────────┴──────────────┘

68k requests in 20.06s, 44.8 MB read
1k errors (602 timeouts)