test/load/#10_04-04-2024.txt
$ npm run test:stress

> car-rent-nest@0.0.1 test:stress
> npx autocannon -c 500 -d 20 -w 10 -W [ -c 1 -d 3 ] --renderStatusCodes --latency http://localhost:3000/cars

Running 3s warmup @ http://localhost:3000/cars
1 connections
10 workers

Running 20s test @ http://localhost:3000/cars
500 connections
10 workers

\
┌─────────┬────────┬────────┬─────────┬─────────┬───────────┬────────────┬──────────┐
│ Stat    │ 2.5%   │ 50%    │ 97.5%   │ 99%     │ Avg       │ Stdev      │ Max      │
├─────────┼────────┼────────┼─────────┼─────────┼───────────┼────────────┼──────────┤
│ Latency │ 212 ms │ 222 ms │ 3707 ms │ 4257 ms │ 675.94 ms │ 1423.58 ms │ 19740 ms │
└─────────┴────────┴────────┴─────────┴─────────┴───────────┴────────────┴──────────┘
┌───────────┬────────┬────────┬─────────┬─────────┬──────────┬─────────┬────────┐
│ Stat      │ 1%     │ 2.5%   │ 50%     │ 97.5%   │ Avg      │ Stdev   │ Min    │
├───────────┼────────┼────────┼─────────┼─────────┼──────────┼─────────┼────────┤
│ Req/Sec   │ 1.615  │ 1.615  │ 2.253   │ 2.321   │ 2.177,85 │ 199,07  │ 1.615  │
├───────────┼────────┼────────┼─────────┼─────────┼──────────┼─────────┼────────┤
│ Bytes/Sec │ 730 kB │ 730 kB │ 1.02 MB │ 1.05 MB │ 984 kB   │ 89.9 kB │ 730 kB │
└───────────┴────────┴────────┴─────────┴─────────┴──────────┴─────────┴────────┘
┌──────┬───────┐
│ Code │ Count │
├──────┼───────┤
│ 200  │ 43548 │
└──────┴───────┘

Req/Bytes counts sampled once per second.
# of samples: 200

┌────────────┬──────────────┐
│ Percentile │ Latency (ms) │
├────────────┼──────────────┤
│ 0.001      │ 99           │
├────────────┼──────────────┤
│ 0.01       │ 100          │
├────────────┼──────────────┤
│ 0.1        │ 137          │
├────────────┼──────────────┤
│ 1          │ 195          │
├────────────┼──────────────┤
│ 2.5        │ 212          │
├────────────┼──────────────┤
│ 10         │ 215          │
├────────────┼──────────────┤
│ 25         │ 218          │
├────────────┼──────────────┤
│ 50         │ 222          │
├────────────┼──────────────┤
│ 75         │ 244          │
├────────────┼──────────────┤
│ 90         │ 2643         │
├────────────┼──────────────┤
│ 97.5       │ 3707         │
├────────────┼──────────────┤
│ 99         │ 4257         │
├────────────┼──────────────┤
│ 99.9       │ 17551        │
├────────────┼──────────────┤
│ 99.99      │ 19664        │
├────────────┼──────────────┤
│ 99.999     │ 19740        │
└────────────┴──────────────┘

45k requests in 20.13s, 19.7 MB read
1k errors (0 timeouts)